IDEA Open Model
SteelSetup Class
Compatible with IDEA StatiCa v 10.1
 ISteelSetup
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.SteelSetup
 IdeaRS.OpenModel.SteelSetupAISC
 IdeaRS.OpenModel.SteelSetupAUS
 IdeaRS.OpenModel.SteelSetupCISC
 IdeaRS.OpenModel.SteelSetupECEN
 IdeaRS.OpenModel.SteelSetupRUS
 Namespace: IdeaRS.OpenModel
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.0.1 (10.1.0.1)
Syntax
public abstract class SteelSetup
Public MustInherit Class SteelSetup
public ref class SteelSetup abstract
The SteelSetup type exposes the following members.
Constructors
Name | Description
SteelSetup
Initializes a new instance of the SteelSetup class
Top
Methods
Name | Description
FrictionCoefficientPboltDefault
 Friction Coefficient Pbolt Default
Top
See Also
Reference
IdeaRS.OpenModel Namespace